{
    "class_name": "Model", 
    "keras_version": "2.1.5", 
    "config": {
        "layers": [
            {
                "class_name": "InputLayer", 
                "config": {
                    "dtype": "float32", 
                    "batch_input_shape": [
                        null, 
                        1, 
                        24, 
                        113
                    ], 
                    "name": "input_1", 
                    "sparse": false
                }, 
                "inbound_nodes": [], 
                "name": "input_1"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_2", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "input_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_2"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_4", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "input_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_4"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_2"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_2"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_4"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_4", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_4"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "config": {
                    "name": "max_pooling2d_1", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "pool_size": [
                        1, 
                        5
                    ], 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "input_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "max_pooling2d_1"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_1", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "input_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_1"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_3", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        3
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_3"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_5", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        5
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_4", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_5"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_6", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_6"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_1"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_1"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_3"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_3", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_3"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_5"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_5", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_5"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_6"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_6", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_6"
            }, 
            {
                "class_name": "Concatenate", 
                "config": {
                    "trainable": true, 
                    "name": "concatenate_1", 
                    "axis": -1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_1", 
                            0, 
                            0, 
                            {}
                        ], 
                        [
                            "elu_3", 
                            0, 
                            0, 
                            {}
                        ], 
                        [
                            "elu_5", 
                            0, 
                            0, 
                            {}
                        ], 
                        [
                            "elu_6", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "concatenate_1"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_7"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "concatenate_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_7"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_8", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_7", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_8"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_10", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_7", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_10"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_9"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_8", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_9"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_11"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_10", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_11"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "config": {
                    "name": "max_pooling2d_2", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "pool_size": [
                        1, 
                        5
                    ], 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_7", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "max_pooling2d_2"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_7", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_7", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_7"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_9", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        3
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_9", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_9"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_11", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        5
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_11", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_11"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_12", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_12"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_8"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_7", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_8"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_10"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_9", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_10"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_12"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_11", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_12"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_13"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_12", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_13"
            }, 
            {
                "class_name": "Concatenate", 
                "config": {
                    "trainable": true, 
                    "name": "concatenate_2", 
                    "axis": -1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_8", 
                            0, 
                            0, 
                            {}
                        ], 
                        [
                            "elu_10", 
                            0, 
                            0, 
                            {}
                        ], 
                        [
                            "elu_12", 
                            0, 
                            0, 
                            {}
                        ], 
                        [
                            "elu_13", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "concatenate_2"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_14"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "concatenate_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_14"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_14", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_14", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_14"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_16", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_14", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_16"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_16"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_14", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_16"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_18"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_16", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_18"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "config": {
                    "name": "max_pooling2d_3", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "pool_size": [
                        1, 
                        5
                    ], 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_14", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "max_pooling2d_3"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_13", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_14", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_13"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_15", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        3
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_16", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_15"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_17", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        5
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_18", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_17"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_18", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "same", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 128, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        1
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_3", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_18"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_15"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_13", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_15"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_17"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_15", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_17"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_19"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_17", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_19"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_20"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_18", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "elu_20"
            }, 
            {
                "class_name": "Concatenate", 
                "config": {
                    "trainable": true, 
                    "name": "concatenate_3", 
                    "axis": -1
                }, 
                "inbound_nodes": [
                    [
                        [
                            "elu_15", 
                            0, 
                            0, 
                            {}
                        ], 
                        [
                            "elu_17", 
                            0, 
                            0, 
                            {}
                        ], 
                        [
                            "elu_19", 
                            0, 
                            0, 
                            {}
                        ], 
                        [
                            "elu_20", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "concatenate_3"
            }, 
            {
                "class_name": "ELU", 
                "config": {
                    "alpha": 1.0, 
                    "trainable": true, 
                    "name": "elu_21"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "concatenate_3", 
                            0, 
                            0, 
