{
    "class_name": "Model", 
    "keras_version": "2.0.3", 
    "config": {
        "layers": [
            {
                "class_name": "InputLayer", 
                "config": {
                    "dtype": "float32", 
                    "batch_input_shape": [
                        null, 
                        1, 
                        24, 
                        113
                    ], 
                    "name": "input_1", 
                    "sparse": false
                }, 
                "inbound_nodes": [], 
                "name": "input_1"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_1", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "relu", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 64, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        5
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "input_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_1"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_2", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "relu", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 64, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        5
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_2"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_3", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "relu", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 64, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        5
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_3"
            }, 
            {
                "class_name": "Conv2D", 
                "config": {
                    "kernel_constraint": null, 
                    "kernel_initializer": {
                        "class_name": "RandomNormal", 
                        "config": {
                            "seed": null, 
                            "stddev": 0.05, 
                            "mean": 0.0
                        }
                    }, 
                    "name": "conv2d_4", 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "relu", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 64, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        1, 
                        5
                    ]
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_3", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "conv2d_4"
            }, 
            {
                "class_name": "Reshape", 
                "config": {
                    "target_shape": [
                        8, 
                        64
                    ], 
                    "trainable": true, 
                    "name": "reshape_1"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_4", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "reshape_1"
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "rate": 0.5, 
                    "trainable": true, 
                    "name": "dropout_1"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "reshape_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "dropout_1"
            }, 
            {
                "class_name": "LSTM", 
                "config": {
                    "recurrent_activation": "hard_sigmoid", 
                    "trainable": true, 
                    "recurrent_initializer": {
                        "class_name": "Orthogonal", 
                        "config": {
                            "seed": null, 
                            "gain": 1.0
                        }
                    }, 
                    "use_bias": true, 
                    "bias_regularizer": null, 
                    "implementation": 2, 
                    "unroll": false, 
                    "activation": "tanh", 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "units": 128, 
                    "unit_forget_bias": true, 
                    "activity_regularizer": null, 
                    "recurrent_dropout": 0.0, 
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "kernel_constraint": null, 
                    "dropout": 0.0, 
                    "stateful": false, 
                    "recurrent_regularizer": null, 
                    "name": "lstm_1", 
                    "bias_constraint": null, 
                    "go_backwards": false, 
                    "kernel_regularizer": null, 
                    "return_sequences": true, 
                    "recurrent_constraint": null
                }, 
                "inbound_nodes": [
                    [
                        [
                            "dropout_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "lstm_1"
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "rate": 0.5, 
                    "trainable": true, 
                    "name": "dropout_2"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "lstm_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "dropout_2"
            }, 
            {
                "class_name": "LSTM", 
                "config": {
                    "recurrent_activation": "hard_sigmoid", 
                    "trainable": true, 
                    "recurrent_initializer": {
                        "class_name": "Orthogonal", 
                        "config": {
                            "seed": null, 
                            "gain": 1.0
                        }
                    }, 
                    "use_bias": true, 
                    "bias_regularizer": null, 
                    "implementation": 2, 
                    "unroll": false, 
                    "activation": "tanh", 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "units": 128, 
                    "unit_forget_bias": true, 
                    "activity_regularizer": null, 
                    "recurrent_dropout": 0.0, 
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "kernel_constraint": null, 
                    "dropout": 0.0, 
                    "stateful": false, 
                    "recurrent_regularizer": null, 
                    "name": "lstm_2", 
                    "bias_constraint": null, 
                    "go_backwards": false, 
                    "kernel_regularizer": null, 
                    "return_sequences": false, 
                    "recurrent_constraint": null
                }, 
                "inbound_nodes": [
                    [
                        [
                            "dropout_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "lstm_2"
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "rate": 0.5, 
                    "trainable": true, 
                    "name": "dropout_3"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "lstm_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "dropout_3"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "uniform", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_avg"
                        }
                    }, 
                    "name": "dense_1", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "softmax", 
                    "trainable": true, 
                    "kernel_regularizer": null, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "units": 18, 
                    "use_bias": true, 
                    "activity_regularizer": {
                        "class_name": "L1L2", 
                        "config": {
                            "l2": 0.009999999776482582, 
                            "l1": 0.0
                        }
                    }
                }, 
                "inbound_nodes": [
                    [
                        [
                            "dropout_3", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "name": "dense_1"
            }
        ], 
        "input_layers": [
            [
                "input_1", 
                0, 
                0
            ]
        ], 
        "output_layers": [
            [
                "dense_1", 
                0, 
                0
            ]
        ], 
        "name": "model_1"
    }, 
    "backend": "tensorflow"
}